{"free_notes":[{"id":20181546142718504,"author":"几道小山","title":"学习英语","contents":["最近出了重新学习数学，也同时开始背诵英语单词","说实话对英语毫无兴趣，读书期间学英语纯粹是应付考试，像现在这样主动学习英语，让我自己也觉得不可思议，但是英语对应程序员来说是一门必不可少的技能。在我自学了这么久编程之后，我也很认可这个说法，虽然现在Google浏览器可以把英语网站文档直接翻译成汉语，但是毕竟是机器翻译，内容难免有疏漏和错误，而且依靠这样的手段对于自己的长远发展也是不利的。","对我而言，学英语不是考托福雅思，也不是要出国留学（或许这辈子都无法出国留学），而是方便阅读英语技术文档，所以我现在的学习目标就是多积累英语单词量，而对于听、说和写则没有任何要求。","或许是太久没有学英语了，而且读书期间也没有主动背很多单词，虽然过了四级，但是现在很多单词都不是很熟悉，一切基本是从0开始，现在每天记忆10-20个单词，争取一年内把单词量提升到5000左右（包括原先能记住的那部分的单词），然后是一定要坚持学习。"],"date_time":"2018-12-30 12:10:13","tags":["英语","随笔","自学","前端","程序员"],"views":43},{"id":20181545817176270,"author":"几道小山","title":"学习数学","contents":["说出来，我自己都不相信，我花了两天时间把初中数学过了一遍。","前不久看过一篇文章，有一个准备转行做程序员的兄弟开始从小学四年级的数学开始学习数学，当我看到这个都是非常惊讶，但是往后看了一下，人家的学历比较低，而且数学底子也差，既然有这样的决心学习，从小学开始也无可厚非，毕竟学无止境，只要肯学习，总是好的，总比那些坐井观天，不求进取的人要值得尊敬。在此祝这位兄弟能早日学成，成功转行做程序，也祝自己早日转行成功。","在自学的过程中经常听到学习编程，数学基础非常重要。刚开始学的时候我差点决定先把高等数学过一遍，但是当书买回来的时候，我改变了我的想法——因为有八本书，全部看完，估计就不用编程了，所以我转变了学习方法。前两个月把编程的基础入门书看了一遍，顺便练习一些基础的编程，涉及的范围比较广，这个时期大概就是一个培养兴趣的过程，可以说非常无聊，但是不得不把计算机组成原理，算法结构等大大小小六七本软件工程入门书籍看了一遍，中间涉猎了Java编程，Python编程，C语言等编程语言，也了解了一下面向对象编程，而数学放在了一边，直到今天一本书也没有翻过，因为我知道时机还没到","两个月时间看六七本专业书，我知道这样的速度看的书只能是过眼云烟，可以说只能留一个影响，而我的目的也只是留一个印象，我相信很多转换做程序的朋友一定是直接上手一门编程语言的（目标语言），而我这样的做法无非延长了学习时间，而且效果也不好，但我觉得，无人如何，底层理论知识还是要有一些的，与其以后去补充，不如在前期做一些储备，也许记不住，但是有了印象，以后再细入学习的话应该能事半功倍，抱着这样的学习思维，读了两个月的理论，然后开始了真正的编程之路——前端编程","学习前端的过程，很多人都说前端对于数学的要求不高，我发现很多转行做前端的也是形形色色，或许数学对于前端而言真的是可有可无的，学习过程中也确实发现，CSS，HTML都很少用到数学，这或许是前端的入门门槛比较低的原因。但我觉得，技多不压身，数学很有趣，于是我在最近决定开始学习数学（粗略地学习）","从小学四年级开始学，我觉得没必要，但是直接从高等数学开始，我想应该会比较吃力（大学毕业已经七年了，期间没有接触过数学，而且大学期间也没有认真学过数学），所以最终决定从初中开始把基础的数学过一遍，然后再学习高等数学。每天大概花一个小时学数学，前几天把初中数学过了一遍，现在在学习高中数学，很多东西都忘了，虽然题目会解，但是原理全忘了。高中的部分内容比较多，估计要花一个月（每天一小时，其他时间写写小项目），然后把高等数学过一遍（大概半年）。","快过年了，祝大家新年快乐！也祝自己早日转行成功！"],"date_time":"2018-12-26 17:58:33","tags":["数学","自学","前端","程序员","随笔"],"views":703},{"id":20181545710002092,"author":"几道小山","title":"第一篇博文--不知道写点什么","contents":["第一次开博客是大学在读期间，那时候在其他平台注册了一个博客，偶尔有空写一点点随笔，那是一个特殊的年代（没有微博，也没有微信），博客竟然也有一点点流量，大学毕业后就没有继续写博客了。","如今，我自己写了一个博客，其实有很多漂亮的博客模板，可以非常快捷地创建一个博客，但我依然决定自己写一个，毕竟准备转行做前端开发，最简单的博客都不自己写一个，那么那些大型的企业网站、商业网站还怎么上手呢？","于是兴致勃勃地写了这个博客，功能单一，甚至有些简陋，但不影响它作为一个展示网站，剩下的就是内容的扩充，这是一个漫长的过程，我本人并不擅长于写文章，所以以后可能会从其他地方搬运一些内容过来，做一个勤劳的搬运工也是很辛苦的，在文末会留下转载内容的原始网站和作者。","谢谢！"],"date_time":"2018-12-23 20:28:33","tags":["随笔","申明","前端","搬运工","随笔"],"views":364}]}